update readme and code assessment
